# **10/30/2021** 
---

## handling mysql from python

In [1]:
import mysql.connector as conn
import pandas as pd

In [2]:
mydb = conn.connect(host= 'localhost', user='root',passwd = 'absm1827')

In [3]:
query = "show databases"

In [4]:
cursor = mydb.cursor()
cursor.fetchall

In [5]:
mydb

In [6]:
cursor = mydb.cursor()
cursor.execute("create database testineuron1")

In [7]:
query = 'create table testineuron1.ineuron(student INT(10),firstname VARCHAR(20), lastname VARCHAR(30) , registrationdate DATE, classname VARCHAR(60), section VARCHAR(30))'

In [8]:
cursor = mydb.cursor()
cursor.execute(query)

In [9]:
mydb = conn.connect(host= 'localhost', user='root',passwd = 'absm1827', database = "testineuron1")
cursor = mydb.cursor()
cursor.execute('show tables')

In [10]:
cursor.fetchall()

[('ineuron',)]

In [11]:
cursor.execute('insert into ineuron values(423454,"aku","bagla","2021-10-30","MLDL","four")')

In [12]:
cursor.execute('select * from ineuron')
cursor.fetchall()

[(423454, 'aku', 'bagla', datetime.date(2021, 10, 30), 'MLDL', 'four')]

In [13]:
pd.read_sql('select * from ineuron', mydb)

   student firstname lastname registrationdate classname section
0   423454       aku    bagla       2021-10-30      MLDL    four

In [20]:
import csv

In [34]:
query1 = "create table testineuron1.glassdata(RI float(10,5), Na float(10,5),Mg float(10,5),Al float(10,5),Si float(10,5),K float(10,5),Ca float(10,5),Ba float(10,5),Fe float(10,5), Class INT(5))"

In [35]:
cursor = mydb.cursor()
cursor.execute(query1)

In [39]:
with open('glass.csv','r') as f:
    glass_data = csv.reader(f, delimiter ='\n')
    for lines in enumerate(glass_data):
        for list_ in (lines[1]):
            cursor.execute('insert into glassdata values({values})'.format(values=list_))
    mydb.commit()

In [40]:
pd.read_sql('select * from glassdata', mydb)

          RI     Na    Mg    Al     Si     K    Ca    Ba   Fe  Class
0    1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.00  0.0      1
1    1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.00  0.0      1
2    1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.00  0.0      1
3    1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.00  0.0      1
4    1.51742  13.27  3.62  1.24  73.08  0.55  8.07  0.00  0.0      1
..       ...    ...   ...   ...    ...   ...   ...   ...  ...    ...
209  1.51623  14.14  0.00  2.88  72.61  0.08  9.18  1.06  0.0      7
210  1.51685  14.92  0.00  1.99  73.06  0.00  8.40  1.59  0.0      7
211  1.52065  14.36  0.00  2.02  73.42  0.00  8.44  1.64  0.0      7
212  1.51651  14.38  0.00  1.94  73.61  0.00  8.48  1.57  0.0      7
213  1.51711  14.23  0.00  2.08  73.36  0.00  8.62  1.67  0.0      7

[214 rows x 10 columns]